Revit 2026 API

# EnergyDataSettingsPercentageSkylights Property

---

Used for the conceptual energy model. The approximate percentage of the building roof surfaces in massing instances for the Conceptual Energy Analytical Model.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PercentageSkylights { get; set; }
```
```vb
Public Property PercentageSkylights As Double
	Get
	Set
```
```cpp
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
```
```fsharp
member PercentageSkylights : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The percentage skylights value is between 0.00 and 0.95. |

This value is used to automatically model the skylights in massing instances when the Energy Analytical model is being created.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace